<a href="https://colab.research.google.com/github/NishadSoney/Project-131/blob/master/Copy_of_gravity_131.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [37]:
import pandas as pd

In [38]:
# from google.colab import files
# uploaded = files.upload()

In [39]:
df = pd.read_csv('gravity_data131.csv')

In [40]:
df.head()

   Unnamed: 0  Unnamed: 0.1       Star_name     Distance  Mass Radius  radius
0           0             0             Sun  0.000015813   1.0      1    1.00
1           1             1          Sirius          8.6   2.1  1.71´    1.71
2           2             2         Canopus          310  15.0     71   71.00
3           3             3  Alpha Centauri          4.4   1.1    1.2    1.20
4           4             4        Arcturus           37   1.1     26   26.00

In [41]:
df.columns

Index(['Unnamed: 0', 'Unnamed: 0.1', 'Star_name', 'Distance', 'Mass', 'Radius',
       'radius'],
      dtype='object')

In [42]:
df.drop(['Unnamed: 0'],axis=1,inplace=True)

In [43]:
df.head()

   Unnamed: 0.1       Star_name     Distance  Mass Radius  radius
0             0             Sun  0.000015813   1.0      1    1.00
1             1          Sirius          8.6   2.1  1.71´    1.71
2             2         Canopus          310  15.0     71   71.00
3             3  Alpha Centauri          4.4   1.1    1.2    1.20
4             4        Arcturus           37   1.1     26   26.00

In [44]:
df.head()

   Unnamed: 0.1       Star_name     Distance  Mass Radius  radius
0             0             Sun  0.000015813   1.0      1    1.00
1             1          Sirius          8.6   2.1  1.71´    1.71
2             2         Canopus          310  15.0     71   71.00
3             3  Alpha Centauri          4.4   1.1    1.2    1.20
4             4        Arcturus           37   1.1     26   26.00

In [45]:
df.dtypes

Unnamed: 0.1      int64
Star_name        object
Distance         object
Mass            float64
Radius           object
radius          float64
dtype: object

We will be calculating the median values of both the columns i.e. radius and Mass cols. and then we will be replacing the Nan values by the median values. we will also replace the values that are 0.0 by the median.

In [46]:
#calculating the median for the Mass column
mass_median= df['Mass'].median()

In [47]:
#calculating the median for the radius column
radius_median= df['radius'].median()

In [48]:
#Extracting the indices of the Null values of column radius.
miss_radius_indices= df.loc[df['radius'].isnull()==True, 'radius'].index

In [49]:
#Extracting the indices of the Null values of column Mass.
miss_mass_indices= df.loc[df['Mass'].isnull()==True, 'Mass'].index

In [50]:
#Replacing the missing values by the median
df.loc[miss_mass_indices, 'Mass']= mass_median

In [51]:
#Replacing the missing values by the median
df.loc[miss_radius_indices, 'radius']=radius_median

In [52]:
#replacing the 0 values by the median
df.loc[df['Mass']==0.0, 'Mass']= mass_median

In [53]:
#replacing the 0 values by the median
df.loc[df['radius']==0.0, 'radius']= radius_median

In [54]:
radius = df['radius'].to_list()
mass = df['Mass'].to_list()
gravity =[]

def convert_to_si(radius,mass):
    for i in range(0,len(radius)-1):
        radius[i] = radius[i]*6.957e+8
        mass[i] = mass[i]*1.989e+30
        
convert_to_si(radius,mass)

In [55]:
def gravity_calculation(radius,mass):
    G = 6.674e-11
    for index in range(0,len(mass)):
      if mass[index]==0:
        continue
      else:
        g= (mass[index]*G)/((radius[index])**2)
        gravity.append(g)
        
gravity_calculation(radius,mass)

df["Gravity"] = gravity
df

     Unnamed: 0.1        Star_name     Distance  ...  Radius radius       Gravity
0               0              Sun  0.000015813  ...       1   1.00  2.742692e+02
1               1           Sirius          8.6  ...   1.71´   1.71  1.969718e+02
2               2          Canopus          310  ...      71  71.00  8.161153e-01
3               3   Alpha Centauri          4.4  ...     1.2   1.20  2.095112e+02
4               4         Arcturus           37  ...      26  26.00  4.462960e-01
..            ...              ...          ...  ...     ...    ...           ...
444           347   WISE 2348-1028         54.1  ...     NaN   1.18  5.909275e+03
445           348   WISE 2357+1227         54.8  ...     NaN   1.18  5.909275e+03
446           349   WISE 2359-7335         42.7  ...     NaN   1.18  5.909275e+03
447           350  WISEA 1101+5400          111  ...     NaN   1.18  5.909275e+03
448           351           2M1510          120  ...     NaN   1.18  1.437949e-09

[449 rows x 7 columns]

In [56]:
#df['Distance']=df['Distance'].apply(lambda x: x.replace('$', '').replace(',', '')).astype('float')
df.to_csv("star_with_gravity.csv")

In [57]:
df.dtypes

Unnamed: 0.1      int64
Star_name        object
Distance         object
Mass            float64
Radius           object
radius          float64
Gravity         float64
dtype: object